# Created 2026-02-25 qua 09:23
#+title: Structure and interpretation of computer programs(SICP)
#+author: Erik Ap Gomes Rocha
#+export_file_name: ~/Projetos/Codigos/Estudos-em-Redes-e-Linguagens/linguagens/notas_literarias_jaks.org
** 1.1.4 Procedimentos compostos

Podemos nomear a composição de procedimentos e chamá-la como se fosse uma unidade.
Exemplo:
#+begin_src scheme :session sicp :results none
(define (square x) (* x x))
#+end_src

Esta é a composição do procedimento (* x x) e de nomeá-lo de square.

Forma geral:
(define (<name> <formal parameters>) <body>)

- Separar as definições abaixo em uma lista

Onde:
"The <name> is a symbol to be associated with the procedure definition in
the environment.13 The <formal parameters> are the names used within
the body of the procedure to refer to the corresponding arguments of the
procedure. The <body> is an expression that will yield the value of the
procedure application when the formal parameters are replaced by the
actual arguments to which the procedure is applied.14 The <name> and
the <formal parameters> are grouped within parentheses, just as they
would be in an actual call to the procedure being defined.
"

#+begin_src scheme :session sicp :exports both
(square 21)
#+end_src

#+results: 
: 441


#+begin_src scheme :session sicp  :results none
(define (sum-of-squares x y)
  (+ (square x) (square y)))
#+end_src

#+begin_src scheme :session sicp :exports both
(sum-of-squares 3 4)
#+end_src

#+results: 
: 25


Agora podemos usar a =sum-of-squares= como bloco de construção de procedimentos.

#+begin_src scheme :session sicp :exports both :results value
(define (f a)
  (sum-of-squares (+ a 1) (* a 2)))
(f 5)
#+end_src

#+results: 
: 136


Procedimentos compostos são usados da mesma forma que procedimentos primitivos, ou seja, não podemos diferenciá-los de =*= ou =+=.
*** Ex 1.1


#+begin_src scheme :tangle exercicios/ex11.scm
10
#+end_src

#+results: 
: 10


#+begin_src scheme :tangle exercicios/ex11.scm
(+ 5 3 4)
#+end_src

#+results: 
: 12


#+begin_src scheme :tangle exercicios/ex11.scm
(- 9 1)
#+end_src

#+results: 
: 8


#+begin_src scheme :tangle exercicios/ex11.scm
(/ 6 2)
#+end_src

#+results: 
: 3


#+begin_src scheme :tangle exercicios/ex11.scm
(+ (* 2 4) (- 4 6))
#+end_src

#+results: 
: 6


#+begin_src scheme :tangle exercicios/ex11.scm
(define a 3)
#+end_src

#+results: 
: #<unspecified>


#+begin_src scheme :tangle exercicios/ex11.scm
(define b (+ a 1))
#+end_src

#+results: 
: #<unspecified>


#+begin_src scheme :tangle exercicios/ex11.scm
(+ a b (* a b))
#+end_src

#+results: 
: 19


#+begin_src scheme :tangle exercicios/ex11.scm
(= a b)
#+end_src

#+results: 
: #f


#+begin_src scheme :tangle exercicios/ex11.scm
(if (and (> b a) (< b (* a b)))
    b
    a)
#+end_src

#+results: 
: 4


#+begin_src scheme :tangle exercicios/ex11.scm
(cond ((= a 4) 6)
      ((= b 4) (+ 6 7 a))
      (else 25))
#+end_src

#+results: 
: 16


#+begin_src scheme :tangle exercicios/ex11.scm
(+ 2 (if (> b a) b a))
#+end_src

#+results: 
: 6


#+begin_src scheme :tangle exercicios/ex11.scm
(* (cond ((> a b) a)
         ((< a b) b)
         (else -1))
   (+ a 1))
#+end_src

#+results: 
: 16
*** Ex 1.2

#+begin_src scheme :tangle exercicios/ex12.scm
(/ (+ 5 4 (- 2 (- 3 (+ 6 (/ 4 5))))) (* 3 (- 6 2) (- 2 7)))
#+end_src

#+results: 
: -37/150
*** Ex 1.3
#+begin_src scheme :tangle exercicios/ex13.scm :results none
(define (sum-of-squares x y)
;; alredy described
  (+ (* x x) (* y y)))

(define (sum-square-two-larger x y z)
  (if (and (< x y) (< x z))
      ;; if x is smaller sum-of-squares of others
      (sum-of-squares y z)
      (if (and (< y x) (< y z))
          ;; if y is smaller sum-of-squares of others
          (sum-of-squares x z)
          ;; if z is smaller sum-of-squares of others
          (sum-of-squares x y)))
  )
#+end_src

#+begin_src scheme :tangle exercicios/ex13.scm
(sum-square-two-larger 3 4 5)
#+end_src

#+results: 
: 41


#+begin_src scheme :tangle exercicios/ex13.scm
(sum-square-two-larger 4 3 5)
#+end_src

#+results: 
: 41


#+begin_src scheme :tangle exercicios/ex13.scm
(sum-square-two-larger 4 5 3)
#+end_src

#+results: 
: 41
*** Ex 1.4

#+begin_src scheme :tangle exercicios/ex14.scm :results none
(define (a-plus-abs-b a b)
  ((if (> b 0) + -) a b))
#+end_src

#+begin_src scheme :tangle exercicios/ex14.scm
(a-plus-abs-b 3 4)
#+end_src

#+results: 
: 7


#+begin_src scheme :tangle exercicios/ex14.scm
(a-plus-abs-b 3 -4)
#+end_src

#+results: 
: 7


#+begin_src scheme :tangle exercicios/ex14.scm
(a-plus-abs-b -3 4)
#+end_src

#+results: 
: 1
